class Something {

   virtual void sampleVirtualMethod();

   int someInteger;
};

class Something       size(8):
        +---
 0      | {vfptr}
 4      | someInteger
        +---

class Something {    
    virtual void sampleVirtualMethod();
    int someInteger;
    **double someDouble;**
};

class Something       size(24):
        +---
 0      | {vfptr}
 8      | someInteger
        | <alignment member> (size=4)
16      | someDouble
        +---

