> str(q2)
'data.frame':   5 obs. of  7 variables:
 $ name     : Factor w/ 5 levels "1","2",..: 1 2 3 4 5
 $ Intercept: Factor w/ 5 levels "15.4533848220452",..: 1 2 3 4 5
 $ Int.lb   : Factor w/ 5 levels "14.2125590292247",..: 1 2 3 4 5
 $ Int.ub   : Factor w/ 5 levels "17.1483176230248",..: 1 2 3 4 5
 $ BAC      : Factor w/ 5 levels "-0.317030740768092",..: 1 2 3 4 5
 $ Bac.lb   : Factor w/ 5 levels "-0.789518593140102",..: 1 2 3 4 5
 $ Bac.ub   : Factor w/ 5 levels "0.0844578956839408",..: 1 2 3 4 5
> str(q3)
'data.frame':   5 obs. of  2 variables:
 $ CI: Factor w/ 5 levels "(12.17,14.34)",..: 2 1 5 4 3
 $ ci: Factor w/ 5 levels "(-0.31,0.74)",..: 3 5 2 4 1
> q4<-as.data.frame(cbind(name=q2$name,Intercept=q2$Intercept,Interecpt.95.CI=q3$CI,BAC=q2$BAC,BAC.95.CI=q3$ci))
> q4
  name Intercept Interecpt.95.CI BAC BAC.95.CI
1       1         1               2   1         3
2       2         2               1   2         5
3       3         3               5   3         2
4       4         4               4   4         4
5       5         5               3   5         1

> str(q4)
'data.frame':   5 obs. of  5 variables:
 $ name        : int  1 2 3 4 5
 $ Intercept      : int  1 2 3 4 5
 $ Interecpt.95.CI: int  2 1 5 4 3
 $ BAC            : int  1 2 3 4 5
 $ BAC.95.CI      : int  3 5 2 4 1

