local myTab = {1,2,3}
print(#myTab)

local myTab = {}
myTab["hello"] = 100
print(#myTab)

local myTab = {1,2,3,nil,5,nil,7}
print(#myTab)
myTab["test"] = try
print(#myTab)

local myT = {123,456,789}
myT["test"] = 10
print(#myT)

